# PRÁCTICA PANDAS

Vamos a trabajar con un **conjunto de datos público "adults"** con datos del censo de los Estados Unidos, que contiene distintas variables de la población. El fin que se busca es el de clasificar las observaciones segun la variable Ingresos (income), variable dicotómica que indica si son menores o iguales a 50000 $ o bien superiores (“<=50K” o ">50K).

Nosotros en este punto del curso **como práctica de la librería "Pandas" que acabamos de ver, vamos simplemente a echarle un vistazo y a corregir y mejorar algunos aspectos del mismo.**

Los **datos** se encuentran en el archivo **"adult.data"**. **Necesitamos también examinar el archivo "adult.names" que describe el dataset para poder cargar los datos correctamente.**

## CARGA DE LOS DATOS

In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
%matplotlib inline


import warnings
warnings.filterwarnings("ignore", category=DeprecationWarning)

In [2]:
df_adult = pd.read_csv('./adult.data', \
                       header= None, \
                       names = ['age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital-status','occupation', \
                                'relationship', 'race', 'sex','capital-gain', 'capital-loss', 'hours-per-week', \
                                'native-country', 'income'])

In [3]:
df_adult.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
df_adult.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'income'],
      dtype='object')

In [5]:
 # EJEMPLO SUSTITUIR UN CARACTER (espacio en blanco, guion medio) en los 
# NOMBRES DE COLUMNAS

df_adult.columns = [elemento.replace("-","_") for elemento in df_adult.columns.to_list()]

In [6]:
df_adult.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education_num',
       'marital_status', 'occupation', 'relationship', 'race', 'sex',
       'capital_gain', 'capital_loss', 'hours_per_week', 'native_country',
       'income'],
      dtype='object')

## EXPLORAR DATAFRAME

In [7]:
df_adult.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education_num   32561 non-null  int64
 5   marital_status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital_gain    32561 non-null  int64
 11  capital_loss    32561 non-null  int64
 12  hours_per_week  32561 non-null  int64
 13  native_country  32561 non-null  object
 14  income          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [8]:
#contenido nuevo: cambio de tipo
df_adult['education_num'] = df_adult['education_num'].astype('str')

df_adult.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education_num   32561 non-null  object
 5   marital_status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital_gain    32561 non-null  int64
 11  capital_loss    32561 non-null  int64
 12  hours_per_week  32561 non-null  int64
 13  native_country  32561 non-null  object
 14  income          32561 non-null  object
dtypes: int64(5), object(10)
memory usage: 3.7+ MB

**Para manejar más fácil los datos suele ser util separar las variables por tipo:**

In [9]:
variables_continuas = df_adult.select_dtypes(exclude=['object']).columns.to_list()

variables_continuas

['age', 'fnlwgt', 'capital_gain', 'capital_loss', 'hours_per_week']

In [10]:
variables_discretas = df_adult.select_dtypes(include=['object']).columns.to_list()

variables_discretas

['workclass',
 'education',
 'education_num',
 'marital_status',
 'occupation',
 'relationship',
 'race',
 'sex',
 'native_country',
 'income']

In [11]:
df_adult.describe()

                age        fnlwgt  capital_gain  capital_loss  hours_per_week
count  32561.000000  3.256100e+04  32561.000000  32561.000000    32561.000000
mean      38.581647  1.897784e+05   1077.648844     87.303830       40.437456
std       13.640433  1.055500e+05   7385.292085    402.960219       12.347429
min       17.000000  1.228500e+04      0.000000      0.000000        1.000000
25%       28.000000  1.178270e+05      0.000000      0.000000       40.000000
50%       37.000000  1.783560e+05      0.000000      0.000000       40.000000
75%       48.000000  2.370510e+05      0.000000      0.000000       45.000000
max       90.000000  1.484705e+06  99999.000000   4356.000000       99.000000

In [12]:
df_adult.describe(include=['object'])

,workclass,education,education_num,marital_status,occupation,relationship,race,sex,native_country,income
count,32561,32561,32561,32561,32561,32561,32561,32561,32561,32561
unique,9,16,16,7,15,6,5,2,42,2
top,Private,HS-grad,9,Married-civ-spouse,Prof-specialty,Husband,White,Male,United-States,<=50K
freq,22696,10501,10501,14976,4140,13193,27816,21790,29170,24720

In [13]:
variables_discretas

['workclass',
 'education',
 'education_num',
 'marital_status',
 'occupation',
 'relationship',
 'race',
 'sex',
 'native_country',
 'income']

In [14]:
for discreta in variables_discretas:

    print(f'Variable {discreta.upper()}:')
    print('Valores unicos: ')
    print(df_adult[discreta].unique(), end='\n'*2)
    print(df_adult[discreta].value_counts(), end='\n'*2)

Variable WORKCLASS:
Valores unicos:
[' State-gov' ' Self-emp-not-inc' ' Private' ' Federal-gov' ' Local-gov'
 ' ?' ' Self-emp-inc' ' Without-pay' ' Never-worked']

 Private             22696
 Self-emp-not-inc     2541
 Local-gov            2093
 ?                    1836
 State-gov            1298
 Self-emp-inc         1116
 Federal-gov           960
 Without-pay            14
 Never-worked            7
Name: workclass, dtype: int64

Variable EDUCATION:
Valores unicos:
[' Bachelors' ' HS-grad' ' 11th' ' Masters' ' 9th' ' Some-college'
 ' Assoc-acdm' ' Assoc-voc' ' 7th-8th' ' Doctorate' ' Prof-school'
 ' 5th-6th' ' 10th' ' 1st-4th' ' Preschool' ' 12th']

 HS-grad         10501
 Some-college     7291
 Bachelors        5355
 Masters          1723
 Assoc-voc        1382
 11th             1175
 Assoc-acdm       1067
 10th              933
 7th-8th           646
 Prof-school       576
 9th               514
 12th              433
 Doctorate         413
 5th-6th           333
 1st-4th           168
 Preschool          51
Name: education, dtype: int64

Variable EDUCATION_NUM:
Valores unicos:
['13' '9' '7' '14' '5' '10' '12' '11' '4' '16' '15' '3' '6' '2' '1' '8']

9     10501
10     7291
13     5355
14     1723
11     1382
7      1175
12     1067
6       933
4       646
15      576
5       514
8       433
16      413
3       333
2       168
1        51
Name: education_num, dtype: int64

Variable MARITAL_STATUS:
Valores unicos:
[' Never-married' ' Married-civ-spouse' ' Divorced'
 ' Married-spouse-absent' ' Separated' ' Married-AF-spouse' ' Widowed']

 Married-civ-spouse       14976
 Never-married            10683
 Divorced                  4443
 Separated                 1025
 Widowed                    993
 Married-spouse-absent      418
 Married-AF-spouse           23
Name: marital_status, dtype: int64

Variable OCCUPATION:
Valores unicos:
[' Adm-clerical' ' Exec-managerial' ' Handlers-cleaners' ' Prof-specialty'
 ' Other-service' ' Sales' ' Craft-repair' ' Transport-moving'
 ' Farming-fishing' ' Machine-op-inspct' ' Tech-support' ' ?'
 ' Protective-serv' ' Armed-Forces' ' Priv-house-serv']

 Prof-specialty       4140
 Craft-repair         4099
 Exec-managerial      4066
 Adm-clerical         3770
 Sales                3650
 Other-service        3295
 Machine-op-inspct    2002
 ?                    1843
 Transport-moving     1597
 Handlers-cleaners    1370
 Farming-fishing       994
 Tech-support          928
 Protective-serv       649
 Priv-house-serv       149
 Armed-Forces            9
Name: occupation, dtype: int64

Variable RELATIONSHIP:
Valores unicos:
[' Not-in-family' ' Husband' ' Wife' ' Own-child' ' Unmarried'
 ' Other-relative']

 Husband           13193
 Not-in-family      8305
 Own-child          5068
 Unmarried          3446
 Wife               1568
 Other-relative      981
Name: relationship, dtype: int64

Variable RACE:
Valores unicos:
[' White' ' Black' ' Asian-Pac-Islander' ' Amer-Indian-Eskimo' ' Other']

 White                 27816
 Black                  3124
 Asian-Pac-Islander     1039
 Amer-Indian-Eskimo      311
 Other                   271
Name: race, dtype: int64

Variable SEX:
Valores unicos:
[' Male' ' Female']

 Male      21790
 Female    10771
Name: sex, dtype: int64

Variable NATIVE_COUNTRY:
Valores unicos:
[' United-States' ' Cuba' ' Jamaica' ' India' ' ?' ' Mexico' ' South'
 ' Puerto-Rico' ' Honduras' ' England' ' Canada' ' Germany' ' Iran'
 ' Philippines' ' Italy' ' Poland' ' Columbia' ' Cambodia' ' Thailand'
 ' Ecuador' ' Laos' ' Taiwan' ' Haiti' ' Portugal' ' Dominican-Republic'
 ' El-Salvador' ' France' ' Guatemala' ' China' ' Japan' ' Yugoslavia'
 ' Peru' ' Outlying-US(Guam-USVI-etc)' ' Scotland' ' Trinadad&Tobago'
 ' Greece' ' Nicaragua' ' Vietnam' ' Hong' ' Ireland' ' Hungary'
 ' Holand-Netherlands']

 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 France                           29
 Greece                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Cambodia                         19
 Trinadad&Tobago                  19
 Laos                             18
 Thailand                         18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Honduras                         13
 Hungary                          13
 Scotland                         12
 Holand-Netherlands                1
Name: native_country, dtype: int64

Variable INCOME:
Valores unicos:
[' <=50K' ' >50K']

 <=50K    24720
 >50K      7841
Name: income, dtype: int64

**Deberíamos  eliminar los espacios en blanco en las columnas tipo cadena y sustituir la interrogación "?" por el valor nulo**

## CORRECCIÓN DE ERRORES

### Espacios en blanco en los campos cadena

**Nota**: a una **Serie** cuyos datos sean texto (cadena, string), se le pueden **aplicar métodos de cadena** a la Serie completa **anteponiendo la palabra clave "str" en la notación punto.**

In [15]:
def eliminar_espacios(serie):
    return serie.str.strip()

In [16]:
df_adult.race[0]

' White'

In [17]:
eliminar_espacios(df_adult.race)[0]

'White'

In [18]:
df_adult[variables_discretas] = df_adult[variables_discretas].apply(eliminar_espacios)

for discreta in variables_discretas:

    print(f'Variable {discreta.upper()}:')
    print('Valores unicos: ')
    print(df_adult[discreta].unique(), end='\n'*2)

Variable WORKCLASS:
Valores unicos:
['State-gov' 'Self-emp-not-inc' 'Private' 'Federal-gov' 'Local-gov' '?'
 'Self-emp-inc' 'Without-pay' 'Never-worked']

Variable EDUCATION:
Valores unicos:
['Bachelors' 'HS-grad' '11th' 'Masters' '9th' 'Some-college' 'Assoc-acdm'
 'Assoc-voc' '7th-8th' 'Doctorate' 'Prof-school' '5th-6th' '10th'
 '1st-4th' 'Preschool' '12th']

Variable EDUCATION_NUM:
Valores unicos:
['13' '9' '7' '14' '5' '10' '12' '11' '4' '16' '15' '3' '6' '2' '1' '8']

Variable MARITAL_STATUS:
Valores unicos:
['Never-married' 'Married-civ-spouse' 'Divorced' 'Married-spouse-absent'
 'Separated' 'Married-AF-spouse' 'Widowed']

Variable OCCUPATION:
Valores unicos:
['Adm-clerical' 'Exec-managerial' 'Handlers-cleaners' 'Prof-specialty'
 'Other-service' 'Sales' 'Craft-repair' 'Transport-moving'
 'Farming-fishing' 'Machine-op-inspct' 'Tech-support' '?'
 'Protective-serv' 'Armed-Forces' 'Priv-house-serv']

Variable RELATIONSHIP:
Valores unicos:
['Not-in-family' 'Husband' 'Wife' 'Own-child' 'Unmarried' 'Other-relative']

Variable RACE:
Valores unicos:
['White' 'Black' 'Asian-Pac-Islander' 'Amer-Indian-Eskimo' 'Other']

Variable SEX:
Valores unicos:
['Male' 'Female']

Variable NATIVE_COUNTRY:
Valores unicos:
['United-States' 'Cuba' 'Jamaica' 'India' '?' 'Mexico' 'South'
 'Puerto-Rico' 'Honduras' 'England' 'Canada' 'Germany' 'Iran'
 'Philippines' 'Italy' 'Poland' 'Columbia' 'Cambodia' 'Thailand' 'Ecuador'
 'Laos' 'Taiwan' 'Haiti' 'Portugal' 'Dominican-Republic' 'El-Salvador'
 'France' 'Guatemala' 'China' 'Japan' 'Yugoslavia' 'Peru'
 'Outlying-US(Guam-USVI-etc)' 'Scotland' 'Trinadad&Tobago' 'Greece'
 'Nicaragua' 'Vietnam' 'Hong' 'Ireland' 'Hungary' 'Holand-Netherlands']

Variable INCOME:
Valores unicos:
['<=50K' '>50K']

### Codificar correctamente los datos nulos (sustituir "?")

In [19]:
df_adult.replace('?', None, inplace=True)

for discreta in variables_discretas:

    print(f'Variable {discreta.upper()}:')
    print('Valores unicos: ')
    print(df_adult[discreta].unique(), end='\n'*2)

Variable WORKCLASS:
Valores unicos:
['State-gov' 'Self-emp-not-inc' 'Private' 'Federal-gov' 'Local-gov' None
 'Self-emp-inc' 'Without-pay' 'Never-worked']

Variable EDUCATION:
Valores unicos:
['Bachelors' 'HS-grad' '11th' 'Masters' '9th' 'Some-college' 'Assoc-acdm'
 'Assoc-voc' '7th-8th' 'Doctorate' 'Prof-school' '5th-6th' '10th'
 '1st-4th' 'Preschool' '12th']

Variable EDUCATION_NUM:
Valores unicos:
['13' '9' '7' '14' '5' '10' '12' '11' '4' '16' '15' '3' '6' '2' '1' '8']

Variable MARITAL_STATUS:
Valores unicos:
['Never-married' 'Married-civ-spouse' 'Divorced' 'Married-spouse-absent'
 'Separated' 'Married-AF-spouse' 'Widowed']

Variable OCCUPATION:
Valores unicos:
['Adm-clerical' 'Exec-managerial' 'Handlers-cleaners' 'Prof-specialty'
 'Other-service' 'Sales' 'Craft-repair' 'Transport-moving'
 'Farming-fishing' 'Machine-op-inspct' 'Tech-support' None
 'Protective-serv' 'Armed-Forces' 'Priv-house-serv']

Variable RELATIONSHIP:
Valores unicos:
['Not-in-family' 'Husband' 'Wife' 'Own-child' 'Unmarried' 'Other-relative']

Variable RACE:
Valores unicos:
['White' 'Black' 'Asian-Pac-Islander' 'Amer-Indian-Eskimo' 'Other']

Variable SEX:
Valores unicos:
['Male' 'Female']

Variable NATIVE_COUNTRY:
Valores unicos:
['United-States' 'Cuba' 'Jamaica' 'India' None 'Mexico' 'South'
 'Puerto-Rico' 'Honduras' 'England' 'Canada' 'Germany' 'Iran'
 'Philippines' 'Italy' 'Poland' 'Columbia' 'Cambodia' 'Thailand' 'Ecuador'
 'Laos' 'Taiwan' 'Haiti' 'Portugal' 'Dominican-Republic' 'El-Salvador'
 'France' 'Guatemala' 'China' 'Japan' 'Yugoslavia' 'Peru'
 'Outlying-US(Guam-USVI-etc)' 'Scotland' 'Trinadad&Tobago' 'Greece'
 'Nicaragua' 'Vietnam' 'Hong' 'Ireland' 'Hungary' 'Holand-Netherlands']

Variable INCOME:
Valores unicos:
['<=50K' '>50K']

In [20]:
df_adult.isnull().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education_num        0
marital_status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital_gain         0
capital_loss         0
hours_per_week       0
native_country     583
income               0
dtype: int64

In [21]:
df_adult.isnull().mean() * 100

age               0.000000
workclass         5.638647
fnlwgt            0.000000
education         0.000000
education_num     0.000000
marital_status    0.000000
occupation        5.660146
relationship      0.000000
race              0.000000
sex               0.000000
capital_gain      0.000000
capital_loss      0.000000
hours_per_week    0.000000
native_country    1.790486
income            0.000000
dtype: float64

## AÑADIR CAMPO CALCULADO 'capital_dif'. ELIMINAR LOS CAMPOS NO NECESARIOS.

In [22]:
df_adult['capital_dif'] = df_adult['capital_gain'] - df_adult['capital_loss']

df_adult.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income,capital_dif
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,2174
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,0
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,0
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,0
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,0

In [23]:
df_adult.drop(columns=['capital_gain', 'capital_loss'], inplace=True)

df_adult.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,hours_per_week,native_country,income,capital_dif
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K,2174
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K,0
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K,0
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K,0
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K,0

## CODIFICAR LA VARIABLE OBJETIVO

Suele ser usual la variable objetivo si es categórica codificarla a número. Podemos utilizar el método **"replace"** que permite establecer las correspondencias:

In [24]:
muestra_income = df_adult.sample(n=10, random_state=42).income

muestra_income

14160    <=50K
27048    <=50K
28868     >50K
5667     <=50K
7827     <=50K
15382     >50K
4641      >50K
8943     <=50K
216      <=50K
5121      >50K
Name: income, dtype: object

In [25]:
muestra_income.replace({'<=50K': 0, '>50K': 1})

14160    0
27048    0
28868    1
5667     0
7827     0
15382    1
4641     1
8943     0
216      0
5121     1
Name: income, dtype: int64

In [28]:
df_adult.income.value_counts()

<=50K    24720
>50K      7841
Name: income, dtype: int64

In [29]:
df_adult.income[:10].to_list()

['<=50K',
 '<=50K',
 '<=50K',
 '<=50K',
 '<=50K',
 '<=50K',
 '<=50K',
 '>50K',
 '>50K',
 '>50K']

In [30]:
df_adult.income = df_adult.income.replace({'<=50K': 0, '>50K': 1})

df_adult.income.value_counts()

0    24720
1     7841
Name: income, dtype: int64

## NOS HACEMOS ALGUNAS PREGUNTAS.

**-¿Influye la educación en los ingresos?**

In [31]:
df_adult.groupby(by=['education'])['income'].agg('mean').sort_values(ascending=False)

education
Doctorate       0.740920
Prof-school     0.734375
Masters         0.556587
Bachelors       0.414753
Assoc-voc       0.261216
Assoc-acdm      0.248360
Some-college    0.190235
HS-grad         0.159509
12th            0.076212
10th            0.066452
7th-8th         0.061920
9th             0.052529
11th            0.051064
5th-6th         0.048048
1st-4th         0.035714
Preschool       0.000000
Name: income, dtype: float64

**-¿Hay sesgo por la raza?**

In [32]:
df_adult.groupby(by=['race'])['income'].agg('mean').sort_values(ascending=False)

race
Asian-Pac-Islander    0.265640
White                 0.255860
Black                 0.123880
Amer-Indian-Eskimo    0.115756
Other                 0.092251
Name: income, dtype: float64

**- Influencia cruzada**

In [33]:
df_adult.groupby(by=['education','race'])['income'].agg(['mean','count']).sort_values(by='mean', ascending=False)

                                    mean  count
education   race
Prof-school Other               1.000000      4
            Amer-Indian-Eskimo  1.000000      2
Doctorate   Black               0.818182     11
            White               0.747967    369
Prof-school White               0.743191    514
...                                  ...    ...
5th-6th     Black               0.000000     21
9th         Other               0.000000      8
            Amer-Indian-Eskimo  0.000000      5
7th-8th     Other               0.000000     17
10th        Amer-Indian-Eskimo  0.000000     16

[79 rows x 2 columns]

## POR ÚLTIMO GUARDAR EL DATAFRAME PROCESADO

In [34]:
df_adult.to_csv('./adult_final.csv', index=False)